ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS1_1.0.xml
    <register id="SPGSS1_LINCTL" width="32" offset="0x9134" description="UART LIN Mode Control Register">
        <bitfield id="CTRENA" description="LIN Counter Enable. LIN counter will only count when enabled." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Counter enabled"/>
        </bitfield>
        <bitfield id="ZERONE" description="Zero on negative Edge of RXD. When enabled the counter is set to 0 and starts counting on a negative edge of RXD" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Zero on negative edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Zero on negative edge enabled"/>
        </bitfield>
        <bitfield id="CNTRXLOW" description="Count while low Signal on RXD When counter is enabled and the signal on RXD is low, the counter increments." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Count while low Signal on UARTxRXD disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Count while low Signal on UARTxRXD enabled"/>
        </bitfield>
        <bitfield id="LINC0CAP" description="Capture Counter on negative RXD Edge. When enabled the counter value is captured to LINC0 register on each negative RXD edge. A LINC0 interrupt is triggered when enabled." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on negative UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on negative UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC1CAP" description="Capture Counter on positive RXD Edge. When enabled the counter value is captured to LINC1 register on each positive RXD edge. A LINC1 interrupt is triggered when enabled." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on positive UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on positive UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC0_MATCH" description="Counter Compare Match Mode  When this bit is set to 1 a counter compare match with LINC0 register triggers an LINC0 interrupt when enabled." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter compare match mode disabled (capture mode enabled)"/>
            <bitenum id="ENABLE" value="0x1" description="Counter compare match enabled (capture mode disabled)"/>
        </bitfield>
        <bitfield id="EN_FRM_ERR" description="Enable FRAME ERROR" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Frame Error Generation 
If STOP bit of '0' is received, then, FRAME ERROR is not generated"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Frame Error Generation 
If STOP bit of '0' is received, then, FRAME ERROR is generated"/>
        </bitfield>
    </register>
    <register id="SPGSS1_LINC0" width="32" offset="0x9138" description="UART LIN Mode Capture 0 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD falling edge and can generate a LINC0 interrupt when capture is enabled (LINC0CAP = 1).
If compare mode is enabled (LINC0_MATCH = 1), a counter match can generate a LINC0 interrupt." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS1_LINC1" width="32" offset="0x913C" description="UART LIN Mode Capture 1 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD rising edge and can generate a LINC1 interrupt when capture is enabled (LINC1CAP = 1)" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS1_IRCTL" width="32" offset="0x9140" description="eUSCI_Ax IrDA Control Word Register">
        <bitfield id="IRTXPL" description="Transmit pulse length.
Pulse length t(PULSE) = (IRTXPLx + 1) / [2 * f(IRTXCLK)]
(IRTXCLK = functional clock of the UART)" begin="7" end="2" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="IRRXPL" description="IrDA receive input UCAxRXD polarity" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="HIGH" value="0x0" description="IrDA transceiver delivers a high pulse when a light pulse is seen"/>
            <bitenum id="LOW" value="0x1" description="IrDA transceiver delivers a low pulse when a light pulse is seen"/>
        </bitfield>
        <bitfield id="IREN" description="IrDA encoder/decoder enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="IrDA encoder/decoder disabled"/>
            <bitenum id="ENABLE" value="0x1" description="IrDA encoder/decoder enabled"/>
        </bitfield>
        <bitfield id="IRTXCLK" description="IrDA transmit pulse clock select" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BITCLK" value="0x0" description="IrDA encode data is based on the functional clock."/>
            <bitenum id="BRCLK" value="0x1" description="IrDA encode data is based on the Baud Rate clock&lt;
when select 8x oversampling, the IRTXPL cycle should less 8; 
when select 16x oversampling, the IRTXPL cycle should less 16."/>
        </bitfield>
    </register>
    <register id="SPGSS1_UC4_UART_IPSPECIFIC_AMASK" width="32" offset="0x9148" description="Self Address Mask Register">
        <bitfield id="MSK" description="Self Address Mask for 9-Bit Mode  This field contains the address mask that creates a set of addresses that should be matched.  A 0 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register is don't care. A 1 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register must match." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS1_UC4_UART_IPSPECIFIC_ADDR" width="32" offset="0x914C" description="Self Address Register">
        <bitfield id="ADDR" description="Self Address for 9-Bit Mode  This field contains the address that should be matched when UARTxAMASK is FFh." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPGSS1_UC4_UART_LMGMT_DFT_ATRT_TEST0" width="32" offset="0x9E00" description="Test 0 register">
        <bitfield id="DTB_MUX_SEL" description="This bit field is used to select DTB mux digital output signals." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables DTB MUX"/>
            <bitenum id="GRP1" value="0x1" description="Selects test group 1"/>
            <bitenum id="GRP2" value="0x2" description="Selects test group 2"/>
            <bitenum id="GRP3" value="0x3" description="Selects test group 3"/>
            <bitenum id="GRP4" value="0x4" description="Selects test group 4"/>
            <bitenum id="GRP5" value="0x5" description="Selects test group 5"/>
            <bitenum id="GRP6" value="0x6" description="Selects test group 6"/>
            <bitenum id="GRP7" value="0x7" description="Selects test group 7"/>
        </bitfield>
    </register>
    <register id="SPGSS1_UC5_UART_IPSTANDARD_CLKDIV" width="32" offset="0xB000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock
Division factor
0 : DIV_BY_1
1 : DIV_BY_2
....
63: DIV_BY_64" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_3" value="0x2" description="Divide clock source by 3"/>
            <bitenum id="DIV_BY_4" value="0x3" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_5" value="0x4" description="Divide clock source by 5"/>
            <bitenum id="DIV_BY_6" value="0x5" description="Divide clock source by 6"/>
            <bitenum id="DIV_BY_7" value="0x6" description="Divide clock source by 7"/>
            <bitenum id="DIV_BY_8" value="0x7" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_61" value="0x3C" description="Divide clock source by 61"/>
            <bitenum id="DIV_BY_62" value="0x3D" description="Divide clock source by 62"/>
            <bitenum id="DIV_BY_63" value="0x3E" description="Divide clock source by 63"/>
            <bitenum id="DIV_BY_64" value="0x3F" description="Divide clock source by 64"/>
        </bitfield>
    </register>
    <register id="SPGSS1_UC5_UART_IPSTANDARD_CLKSEL" width="32" offset="0xB008" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="BUSCLK_SEL" description="Selects BUS CLK as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
    </register>
