ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS1_1.0.xml
    <register id="SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST0" width="32" offset="0x47E00" description="Test 0 register">
        <bitfield id="DTB_MUX_SEL" description="This bit field is used to select DTB mux digital output signals." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables DTB MUX"/>
            <bitenum id="GRP1" value="0x1" description="Selects test group 1"/>
            <bitenum id="GRP2" value="0x2" description="Selects test group 2"/>
            <bitenum id="GRP3" value="0x3" description="Selects test group 3"/>
            <bitenum id="GRP4" value="0x4" description="Selects test group 4"/>
            <bitenum id="GRP5" value="0x5" description="Selects test group 5"/>
            <bitenum id="GRP6" value="0x6" description="Selects test group 6"/>
            <bitenum id="GRP7" value="0x7" description="Selects test group 7"/>
        </bitfield>
    </register>
    <register id="SPGSS1_UC3_I2CT_LMGMT_DFT_ATRT_TEST1" width="32" offset="0x47E04" description="Test 0 register">
        <bitfield id="SCL_TRIM_EN" description="Analog glitch filter trimming enable for SCL" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Trim for SCL"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Trim for SCL"/>
        </bitfield>
        <bitfield id="SDA_TRIM_EN" description="Analog glitch filter trimming enable for SDA" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Trim for SDA"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Trim for SDA"/>
        </bitfield>
        <bitfield id="TRIM_SEL" description="Select for which branch to trim" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="FALLING_EDGE" value="0x0" description="Select Trim on falling edge"/>
            <bitenum id="RISING_EDGE" value="0x1" description="Select Trim on rising edge"/>
        </bitfield>
        <bitfield id="AGFTEST" description="" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SPGSS1_UC5_I2CT_IPSTANDARD_CLKDIV" width="32" offset="0x4B000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock
Division factor
0 : DIV_BY_1
1 : DIV_BY_2
....
63: DIV_BY_64" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_3" value="0x2" description="Divide clock source by 3"/>
            <bitenum id="DIV_BY_4" value="0x3" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_5" value="0x4" description="Divide clock source by 5"/>
            <bitenum id="DIV_BY_6" value="0x5" description="Divide clock source by 6"/>
            <bitenum id="DIV_BY_7" value="0x6" description="Divide clock source by 7"/>
            <bitenum id="DIV_BY_8" value="0x7" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_61" value="0x3C" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_62" value="0x3D" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_63" value="0x3E" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_64" value="0x3F" description="Divide clock source by 8"/>
        </bitfield>
    </register>
    <register id="SPGSS1_UC5_I2CT_IPSTANDARD_CLKSEL" width="32" offset="0x4B008" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="BUSCLK_SEL" description="Selects BUS CLK as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
    </register>
    <register id="SPGSS1_UC5_I2CT_IPSTANDARD_PDBGCTL" width="32" offset="0x4B018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DEPRECATED" value="0x0" description="Not supported"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="SPGSS1_UC5_I2CT_IPSTANDARD_CPU_INT" name="SPGSS1_UC5_I2CT_IPSTANDARD_CPU_INT" instances="1" offset="0x4B020" instaddr="0x30" description="">
        <register id="SPGSS1_UC5_I2CT_IPSTANDARD_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="I2C Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="RXDONEFG" value="0x1" description="Receive Done Flag"/>
                <bitenum id="TXDONEFG" value="0x2" description="Transmit Done Flag"/>
                <bitenum id="RXTRG" value="0x3" description="receive FIFO Trigger Level"/>
                <bitenum id="TXTRG" value="0x4" description="transmit FIFO Trigger level"/>
                <bitenum id="RXFULL" value="0x5" description="RX FIFO FULL Event/interrupt pending"/>
                <bitenum id="TXEMPTY" value="0x6" description="Transmit FIFO/Buffer Empty Event/interrupt pending"/>
                <bitenum id="TX_UNFL" value="0x7" description="Target TX FIFO underflow"/>
                <bitenum id="RX_OVFL" value="0x8" description="Target RX FIFO overflow event"/>
                <bitenum id="GENCALL" value="0x9" description="General Call Event"/>
                <bitenum id="STARTFG" value="0xA" description="Start Event"/>
                <bitenum id="STOPFG" value="0xB" description="Stop Event"/>
                <bitenum id="PEC_RX_ERR" value="0xC" description="PEC receive error event"/>
                <bitenum id="TIMEOUTA" value="0xD" description="Timeout A Event"/>
                <bitenum id="TIMEOUTB" value="0xE" description="Timeout B Event"/>
                <bitenum id="DMA_DONE_RX" value="0x10" description="DMA DONE on Channel RX"/>
                <bitenum id="DMA_DONE_TX" value="0x11" description="DMA DONE on Channel TX"/>
                <bitenum id="ARBLOSTFG" value="0x12" description="Arbitration Lost"/>
                <bitenum id="DMA_PREIRQ_RX" value="0x13" description="DMA PRE IRQ INTERRUPT"/>
                <bitenum id="DMA_PREIRQ_TX" value="0x14" description="DMA PRE IRQ INTERRUPT"/>
            </bitfield>
        </register>
