ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS1_1.0.xml
        </group>
    <group id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX" name="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX" instances="1" offset="0x61050" instaddr="0x30" description="">
        <register id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RX" description="Receive FIFO event mask." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RTOUT" description="SPI Receive Time-Out event mask." begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RX" description="Receive FIFO event.This interrupt is set if the selected Receive FIFO level has been reached" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RTOUT" description="SPI Receive Time-Out Event.
This bit is set when there is still contents in the FIFO after the timeout period" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RX" description="Receive FIFO event mask." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RTOUT" description="SPI Receive Time-Out event mask." begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RX" description="Set Receive FIFO event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RTOUT" description="Set SPI Receive Time-Out event." begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        </group>
    <group id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX" name="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX" instances="1" offset="0x61080" instaddr="0x30" description="">
        <register id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TX" description="Transmit FIFO event mask." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TX" description="Transmit FIFO event:
A read returns the current mask for transmit FIFO interrupt. On a write of 1, the mask for transmit FIFO interrupt is set which means the interrupt state will be reflected in MIS.TXMIS. A write of 0 clears the mask which means MIS.TXMIS will not reflect the interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TX" description="Masked Transmit FIFO event" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="SPGSS1_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TX" description="Set Transmit FIFO event." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        </group>
    <register id="SPGSS1_UC0_SPI_IPSTANDARD_INTCTL" width="32" offset="0x610E4" description="Interrupt control register">
        <bitfield id="INTEVAL" description="Writing a 1 to this field re-evaluates the interrupt sources." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="EVAL" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
        </bitfield>
    </register>
