ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/SPGSS1_1.0.xml
        </group>
    <register id="SPGSS1_UC5_IPSPECIFIC_IPMODE" width="32" offset="0x8B100" description="Mode Selection Register">
        <bitfield id="SELECT" description="Free run control" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="UART" value="0x0" description="Default functionality is UART"/>
            <bitenum id="SPI" value="0x1" description="SPG in SPI Mode"/>
            <bitenum id="I2C_CONTROLLER" value="0x2" description="SPG in I2C Controller Mode"/>
            <bitenum id="I2C_PERIPHERAL" value="0x3" description="SPG in I2C Peripheral Mode"/>
        </bitfield>
    </register>
    <group id="SPGSS1_UNICOMM_LPBK" name="SPGSS1_UNICOMM_LPBK" instances="1" offset="0xA0120" instaddr="0x20" description="">
        <register id="SPGSS1_LPBK0" width="32" offset="0x0" description="Loopback between SPG instances
User has to ensure that the SPGs looped back have the same underlying IP instantiated; i.e. both UART, both SPI, both I2C, etc.,">
            <bitfield id="CONTROLLER" description="Select SPG controller for loopback. 
Signals invovled in loopback based on interface chosen
1. SPI : CS, SCLK, SDI, SDO 
2. I2C : SCL, SDA
3. UART : TX, RX" begin="11" end="8" width="4" rwaccess="R/W">
                <bitenum id="SPG1" value="0x0" description="SPG commander select for loopback."/>
                <bitenum id="SPG2" value="0x1" description="SPG commander select for loopback."/>
                <bitenum id="SPG3" value="0x2" description="SPG commander select for loopback."/>
                <bitenum id="SPG4" value="0x3" description="SPG commander select for loopback."/>
                <bitenum id="SPG5" value="0x4" description="SPG commander select for loopback."/>
                <bitenum id="SPG6" value="0x5" description="SPG commander select for loopback."/>
                <bitenum id="SPG7" value="0x6" description="SPG commander select for loopback."/>
                <bitenum id="SPG8" value="0x7" description="SPG commander select for loopback."/>
                <bitenum id="SPG9" value="0x8" description="SPG commander select for loopback."/>
                <bitenum id="SPG10" value="0x9" description="SPG commander select for loopback."/>
                <bitenum id="SPG11" value="0xA" description="SPG commander select for loopback."/>
                <bitenum id="SPG12" value="0xB" description="SPG commander select for loopback."/>
                <bitenum id="SPG13" value="0xC" description="SPG commander select for loopback."/>
                <bitenum id="SPG14" value="0xD" description="SPG commander select for loopback."/>
                <bitenum id="SPG15" value="0xE" description="SPG commander select for loopback."/>
                <bitenum id="SPG16" value="0xF" description="SPG commander select for loopback."/>
            </bitfield>
            <bitfield id="EN" description="Loopback  enable" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
                <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
            </bitfield>
            <bitfield id="PERIPHERAL" description="Select SPG peripheral for loopback. 
Signals invovled in loopback based on interface chosen
1. SPI : CS, SCLK, SDI, SDO 
2. I2C : SCL, SDA
3. UART : TX, RX" begin="15" end="12" width="4" rwaccess="R/W">
                <bitenum id="SPG1" value="0x0" description="SPG responder select for loopback."/>
                <bitenum id="SPG2" value="0x1" description="SPG responder select for loopback."/>
                <bitenum id="SPG3" value="0x2" description="SPG responder select for loopback."/>
                <bitenum id="SPG4" value="0x3" description="SPG responder select for loopback."/>
                <bitenum id="SPG5" value="0x4" description="SPG responder select for loopback."/>
                <bitenum id="SPG6" value="0x5" description="SPG responder select for loopback."/>
                <bitenum id="SPG7" value="0x6" description="SPG responder select for loopback."/>
                <bitenum id="SPG8" value="0x7" description="SPG responder select for loopback."/>
                <bitenum id="SPG9" value="0x8" description="SPG responder select for loopback."/>
                <bitenum id="SPG10" value="0x9" description="SPG responder select for loopback."/>
                <bitenum id="SPG11" value="0xA" description="SPG responder select for loopback."/>
                <bitenum id="SPG12" value="0xB" description="SPG responder select for loopback."/>
                <bitenum id="SPG13" value="0xC" description="SPG responder select for loopback."/>
                <bitenum id="SPG14" value="0xD" description="SPG responder select for loopback."/>
                <bitenum id="SPG15" value="0xE" description="SPG responder select for loopback."/>
                <bitenum id="SPG16" value="0xF" description="SPG responder select for loopback."/>
            </bitfield>
        </register>
        </group>
    <group id="SPGSS1_I2C_PAIR" name="SPGSS1_I2C_PAIR" instances="1" offset="0xA01C0" instaddr="0x20" description="">
        <register id="SPGSS1_PAIR0" width="32" offset="0x0" description="Pairing of I2C for MULTI-MASTER/SMBUS applications">
            <bitfield id="CTL" description="UNICOMM instance for loopback. This instance will be treated as the controller." begin="11" end="8" width="4" rwaccess="R/W">
                <bitenum id="SPG1" value="0x0" description="SPG commander select for loopback."/>
                <bitenum id="SPG2" value="0x1" description="SPG commander select for loopback."/>
                <bitenum id="SPG3" value="0x2" description="SPG commander select for loopback."/>
                <bitenum id="SPG4" value="0x3" description="SPG commander select for loopback."/>
                <bitenum id="SPG5" value="0x4" description="SPG commander select for loopback."/>
                <bitenum id="SPG6" value="0x5" description="SPG commander select for loopback."/>
                <bitenum id="SPG7" value="0x6" description="SPG commander select for loopback."/>
                <bitenum id="SPG8" value="0x7" description="SPG commander select for loopback."/>
                <bitenum id="SPG9" value="0x8" description="SPG commander select for loopback."/>
                <bitenum id="SPG10" value="0x9" description="SPG commander select for loopback."/>
                <bitenum id="SPG11" value="0xA" description="SPG commander select for loopback."/>
                <bitenum id="SPG12" value="0xB" description="SPG commander select for loopback."/>
                <bitenum id="SPG13" value="0xC" description="SPG commander select for loopback."/>
                <bitenum id="SPG14" value="0xD" description="SPG commander select for loopback."/>
                <bitenum id="SPG15" value="0xE" description="SPG commander select for loopback."/>
                <bitenum id="SPG16" value="0xF" description="SPG commander select for loopback."/>
            </bitfield>
            <bitfield id="TARGET" description="UNICOMM instance for loopback. This instance will be treated as the target" begin="15" end="12" width="4" rwaccess="R/W">
                <bitenum id="SPG1" value="0x0" description="SPG responder select for loopback."/>
                <bitenum id="SPG2" value="0x1" description="SPG responder select for loopback."/>
                <bitenum id="SPG3" value="0x2" description="SPG responder select for loopback."/>
                <bitenum id="SPG4" value="0x3" description="SPG responder select for loopback."/>
                <bitenum id="SPG5" value="0x4" description="SPG responder select for loopback."/>
                <bitenum id="SPG6" value="0x5" description="SPG responder select for loopback."/>
                <bitenum id="SPG7" value="0x6" description="SPG responder select for loopback."/>
                <bitenum id="SPG8" value="0x7" description="SPG responder select for loopback."/>
                <bitenum id="SPG9" value="0x8" description="SPG responder select for loopback."/>
                <bitenum id="SPG10" value="0x9" description="SPG responder select for loopback."/>
                <bitenum id="SPG11" value="0xA" description="SPG responder select for loopback."/>
                <bitenum id="SPG12" value="0xB" description="SPG responder select for loopback."/>
                <bitenum id="SPG13" value="0xC" description="SPG responder select for loopback."/>
                <bitenum id="SPG14" value="0xD" description="SPG responder select for loopback."/>
                <bitenum id="SPG15" value="0xE" description="SPG responder select for loopback."/>
                <bitenum id="SPG16" value="0xF" description="SPG responder select for loopback."/>
            </bitfield>
            <bitfield id="EN" description="Enable" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
                <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
            </bitfield>
        </register>
        </group>
    <register id="SPGSS1_SPGSS_LMGMT_DFT_ATRT_TEST0" width="32" offset="0xA0C00" description="Test 0 register">
        <bitfield id="DTB_MUX_SEL" description="This bit field is used to select DTB mux digital output signals." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>

</module>